library constants;

class Distortion {
  String emoji;
  String name;
  String description;
  String example;

  Distortion(this.emoji, this.name, this.description, this.example);
}

final List<Distortion> distortionList = [
  Distortion(
      "🧠",
      "Чтение мыслей",
      "Искажение, при котором человек, не имея для этого достаточных оснований, считает, что знает, что думают люди.",
      "Она считает, что я неудачник."),
  Distortion(
      "⌚",
      "Предсказание будущего",
      "Человек предвидит свое ближайшее или отдаленное будущее.",
      "Любые мои попытки знакомства окончатся неудачей."),
  Distortion(
      "💣",
      "Катастрофизация",
      "Человек считает, что то, что произойдет, будет настоящей катастрофой, которую невозможно вынести.",
      "Это ужасно, если меня не примут."),
  Distortion(
      "🏷",
      "Наклеивание ярлыков",
      "Человек глобально оценивает себя или другого человека по отдельным характеристикам.",
      "Я трус или «Он недостойный человек."),
  Distortion(
      "😩",
      "Девальвация позитива",
      "Человек приуменьшает значение позитивных достижений или характеристик, оценивая их как тривиальные.",
      "Такого выступления можно ожидать от любого."),
  Distortion(
      "☣",
      "Негативный фильтр",
      "Человек концентрируется только на негативных результатах, игнорируя позитивные.",
      "Никто не проявил интереса ко мне. В моей жизни были только провалы."),
  Distortion(
      "🌪",
      "Сверхгенерализация",
      "Человек делает глобальные обобщения на основе единичного случая.",
      "Сегодня мой друг даже не обратил на меня внимания. Я никому не нужен."),
  Distortion(
      "🔲",
      "Дихотомическое мышление",
      "Человек мыслит в категориях «все или ничего.",
      "Зачем пытаться еще раз, если ничего не получается."),
  Distortion(
      "🚷",
      "Долженствование",
      "Человек интерпретирует события с позиции долженствования (какими они должны быть), а не с позиции какими они являются.",
      "Я должен достигнуть этого положения, иначе я неудачник."),
  Distortion(
      "👥",
      "Персонализация",
      "Человек целиком приписывает ответственность за произошедшие события себе, не учитывая, что и другие тоже несут часть ответственности.",
      "Например, жена алкоголика, возобновившего потребление: «Я должна была предвидеть этот срыв и принять меры."),
  Distortion(
      "💢",
      "Обвинение",
      "Человек считает, что другой человек несет полную ответственность за его чувства и состояние.",
      "Это он виноват в том, что я чувствую себя никчемной."),
  Distortion(
      "👀",
      "Неадекватные сравнения",
      "Человек интерпретирует события с использованием стандартов, которые являются недостижимыми для него.",
      "Другие получили при тестировании более высокие оценки."),
  Distortion(
      "💤",
      "Ориентация сожаления",
      "Человек фокусируетеся больше на прошлых достижениях, чем на настоящем исполнении, которое заслуживает сожаления.",
      "Раньше я мог выступать несколько часов."),
  Distortion(
      "❓",
      "Что если?",
      "Человек задает вопросы, касающиеся возможного развития событий, и никогда не удовлетворены никаким ответом на ваш вопрос.",
      "Что если страхи возобновятся? или «Что если наши отношения с мужем вновь разладятся?"),
  Distortion(
      "👁️‍🗨️",
      "Эмоциональное мышление",
      "Интерпретация действительно определяется чувствами человека.",
      "Я чувствую тревогу, будущее моего предприятия опасно."),
  Distortion(
      "🆚",
      "Невозможность опровержения",
      "Человек отвергает любую возможность, которая противоречит вашей негативной мысли.",
      "Например, мысль «Я отвергнут всеми» не позволяет увидеть и принять факты, которые противоречат ей."),
  Distortion(
      "👎",
      "Фокусирование на оценке",
      "Человек сфокусирован не на описании событий, окружающих людей или себя, а на оценке.",
      "Я провально справился с последней работой, Он сыграл партию совсем плохо."),
];
